config.org
+title: Steven's Emacs configuration
#+author: Steven Folkersma
#+language: en
#+startup: content
#+property: header-args :results none

* My literal emacs configuration

This file describes my emacs configuration. Feel free to copy parts of the configuration, I do not recommend copying it in full as it contains many personal functions that will mostly likely not work for everyone. The config is heavily inspired by (and parts are copied from) the configs of Prot, karthinks and oantolin.

* The pre initialization of emacs (=early-init.el=)

** The =early-init.el= initialises the package cache

I use the standard =package.el= to manage my Emacs packages [[* The =init.el= section to set up the package manager][The =init.el= section to set up the package manager]].
It works for me and I never had a need for more.
If I have to tinker with a package's source code, I use Git ordinarily---no need for a package manager to also be a development tool.

#+begin_src emacs-lisp :tangle "early-init.el"
;;; -*- lexical-binding: t -*-
;; Initialise installed packages at this early stage, by using the
;; available cache.  I had tried a setup with this set to nil in the
;; early-init.el, but (i) it ended up being slower and (ii) various
;; package commands, like `describe-package', did not have an index of
;; packages to work with, requiring a `package-refresh-contents'.
(setq package-enable-at-startup t)
#+end_src

** The =early-init.el= tweaks to startup time and garbage collection

I do not have a deep understanding of "garbage collection", though I have learnt through trial and error that I can maximise the threshold during startup to make Emacs boot a bit faster.
What I am doing here is to arrange for the relevant values to be set to very high values during startup and then be brought down to something more practical once Emacs is done loading.

#+begin_src emacs-lisp :tangle "early-init.el"
;; Temporarily increase the garbage collection threshold.
;; These changes help shave off about half a second of startup time.
;; The `most-positive-fixnum' is DANGEROUS AS A PERMANENT VALUE.
;; See the `emacs-startup-hook' a few lines below for what I actually use.
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)

;; Same idea as above for the `file-name-handler-alist' and the `vc-handled-backends' with regard to startup speed optimisation.
;; Here I am storing the default value with the intent of restoring it via the `emacs-startup-hook'.
(defvar steven-emacs--file-name-handler-alist file-name-handler-alist)
(defvar steven-emacs--vc-handled-backends vc-handled-backends)

(setq file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 100 100 8)
                  gc-cons-percentage 0.1
                  file-name-handler-alist steven-emacs--file-name-handler-alist
                  vc-handled-backends steven-emacs--vc-handled-backends)))
#+end_src

** The =early-init.el= section setting default frame

From Prot's config:

#+begin_src emacs-lisp :tangle "early-init.el"
(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize 'force
      frame-title-format '("%b")
      ring-bell-function 'ignore
      use-dialog-box t ; only for mouse events, which I seldom use
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name ; read the docstring
      inhibit-startup-buffer-menu t)
#+end_src

Setting default frame parameters. On Linux (Gnome) I use undecorated t,
this will give plain square windows that cannot be resized. Best is to
make full screen or add ctself.

#+begin_src emacs-lisp :tangle "early-init.el"
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)

;; old version for macbook
;; (defvar steven-laptop-p (eq system-type 'darwin)

(defvar steven-laptop-p (null (directory-empty-p "/sys/class/power_supply/"))
  "When non-nil, we assume to be working on a laptop.")

;(when steven-laptop-p (add-hook 'window-size-change-functions #'frame-hide-title-bar-when-maximized))

(defvar steven-pgtk-p (string-match-p "PGTK"
 system-configuration-features)
  "When non-nil, this is a build --with-pgtk.
PGTK is the Wayland-specific build of Emacs.")

(setq initial-frame-alist `((horizontal-scroll-bars . nil)
                            (menu-bar-lines . 0)
                            (tool-bar-lines . 0)
                            (vertical-scroll-bars . nil)
                            (scroll-bar-width . ,(if steven-pgtk-p 12 6))
                            (width . (text-pixels . 800))
                            (height . (text-pixels . 950))
                            ;,@(when steven-pgtk-p
                            ;    (list  '(undecorated . t)))
                            ,@(when steven-laptop-p
                                (list '(undecorated . t)))))

;; Do it again after init so that any intermediate changes are not retained.
;; Note that we cannot rely on setting this to `initial-frame-alist' as that may change in the meantime.
;; We explicitly set the value to be certain of the outcome.
;; This does not inhibit other programs from modifying the list, though I would consider it undesirable if they were touching these specific settings.
(add-hook 'after-init-hook (lambda ()
        (setq default-frame-alist `((horizontal-scroll-bars . nil)
                                 (menu-bar-lines . 0)
                                 (tool-bar-lines . 0)
                                 (vertical-scroll-bars . nil)
                                 (scroll-bar-width . (if steven-pgtk-p 12 6))
                                 (width . (text-pixels . 800))
                                 (height . (text-pixels . 950))
                                 ;,@(when steven-pgtk-p
                                 ;    (list '(undecorated . t)))
                                 ,@(when steven-laptop-p
                                     (list '(undecorated . t)))))))

(defun steven-emacs-no-minibuffer-scroll-bar (frame)
  "Remove the minibuffer scroll bars from FRAME."
  (when scroll-bar-mode
    (set-window-scroll-bars (minibuffer-window frame) nil nil nil nil :persistent)))

(add-hook 'after-make-frame-functions
 #'steven-emacs-no-minibuffer-scroll-bar)
#+end_src

** The =early-init.el= names the default frame

#+begin_src emacs-lisp :tangle "early-init.el"
(add-hook 'after-init-hook (lambda () (set-frame-name "Home")))
#+end_src


* The main initialization of emacs (=init.el=)

** The =init.el= section to set up the package manager

The =package.el= is built into Emacs.
We do not need to load it explicitly, as it will be called by ~use-package~ when it needs it (also Prot's video about [[https://protesilaos.com/codelog/2024-07-23-emacs-use-package-essentials/][~use-package~ essentials]] (2024-07-23)).
Since the introduction of the =early-init.el= file, we also do not need to initialise the packages at this point: we activate the cache instead.

With regard to the settings here, make sure to read my article about package archives, pinning packages, and setting priorities: <https://protesilaos.com/codelog/2022-05-13-emacs-elpa-devel/>.

#+begin_src emacs-lisp :tangle "init.el"
;;; -*- lexical-binding: t -*-
(setq package-archives
      '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
        ("nongnu" . "https://elpa.nongnu.org/nongnu/")
        ("melpa" . "https://melpa.org/packages/")))

;; Highest number gets priority (what is not mentioned has priority 0)
(setq package-archive-priorities
      '(("gnu-elpa" . 3)
        ("melpa" . 2)
        ("nongnu" . 1)))

#+end_src

** The =init.el= section to make native compilation silent

The warnings are not usefull, only for package developers. 

#+begin_src emacs-lisp :tangle "init.el"
;; Make native compilation silent.
(when (native-comp-available-p)
  (setq native-comp-async-report-warnings-errors 'silent))
#+end_src


** The =init.el= section to set folder with custom .el files
#+begin_src emacs-lisp :tangle "init.el" :results silent
(dolist (path '("~/.config/emacs/personal"
                "~/.config/emacs/steven"))
  (add-to-list 'load-path path))
#+end_src

** The =init.el= section to stop emacs from saving backup files
By default, Emacs tries to lock down files so that they are not modified by other programs.
It also keeps backups.
*Note*: I am not sure it removing lockfiles is smart, since I edit the files on mulitple machines.

#+begin_src emacs-lisp :tangle "init.el"
  (setq make-backup-files nil)
  (setq backup-inhibited nil) ; Not sure if needed, given `make-backup-files'
  (setq create-lockfiles nil)
#+end_src

** The =init.el= section to set the custom user file

This is copied from Prot’s config.
By default, Emacs writes persistent customisations to the end of the user's init file. These are encapsulated in a "custom" block. Emacs writes those whenever the user does something with =M-x customize= or related.

I personally prefer writing the actual Elisp over using the interface of =M-x customize=.

#+begin_src emacs-lisp :tangle "init.el"
  ;; Disable the damn thing by making it disposable.
  (setq custom-file (make-temp-file "emacs-custom-"))
  (load custom-file :no-error-if-file-is-missing)
#+end_src



** The =init.el= section to setup gpg-agent

This uses the settings in /.gnupg/gpg-agent.conf. I need to write a manual for this.

#+begin_src emacs-lisp :tangle "init.el"
(setq epg-pinentry-mode 'loopback)
#+end_src

** The =init.el= option to declare all themes as safe

When loading a theme, Emacs will produce a warning explaining how
themes are ordinary Elisp and thus can run harmful code. I understand
why this message is there, but I do not need to be reminded about it.
Setting this to non-nil saves me from the occasional warning if I
ever run ~load-theme~ without a =NO-CONFIRM= argument (like this:
=(load-theme 'modus-operandi :no-confirm)=).

#+begin_src emacs-lisp :tangle "init.el"
(setq custom-safe-themes t)
#+end_src

** The =init.el= section to deal with PATH

This package makes sure the PATH is always the same.
PATH is mostly an issue with macOS, so this currently is setup only for macOS.

#+begin_src emacs-lisp :tangle "init.el" :results silent
(use-package exec-path-from-shell
  :ensure t
  :demand t)

(when (memq window-system '(mac ns))
  (exec-path-from-shell-initialize))
#+end_src

** The =init.el= section with basic settings

Basic settings, these I had before. Somehow this fixes the box color of
org code blocks?. Need to find a good spot for them. Winner-mode allows
me to quickly revert the window config, like if I want to quickly close
a recently opened help buffer.

select-enable-clipboard should allow me to use the system clipboard.

indent-tabs-mode, if non-nil, indentation can insert tabs.

#+begin_src emacs-lisp :tangle "init.el"

;; Prefer lexical binding by default
(set-default-toplevel-value 'lexical-binding t)
(winner-mode 1)
(set-default-coding-systems 'utf-8)

(setq help-window-select t)
(setq save-interprogram-paste-before-kill t)
(setq-default indent-tabs-mode nil
              select-enable-clipboard t)  


;; below are default settings needed on macOS
(if (eq system-type 'darwin)
    (progn
      (setq dired-use-ls-dired t)
      (setq insert-directory-program "/usr/local/bin/gls")
      (setq with-editor-emacsclient-executable
            "/usr/local/bin/emacsclient")))
#+end_src

** The =init.el= section to add basic keybindings

Quality of life snipper from Prot's setup.
#+begin_src emacs-lisp :tangle "init.el"
(defun steven--keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when the
minibuffer is open.
Whereas we want it to close the minibuffer, even without explicitly
focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.
- When a minibuffer is open, but not focused, close the minibuffer.
- When the Completions buffer is selected, close it.
- In every other case use the regular `keyboard-quit'."
  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(define-key global-map (kbd "C-g") #'steven--keyboard-quit-dwim)
#+end_src

Better C-a, from karthinks

#+begin_src emacs-lisp :tangle "init.el"
(defun back-to-indentation-or-beginning () (interactive)
   (if (= (point) (progn (beginning-of-line-text) (point)))
       (beginning-of-line)))
#+end_src

Some settings from the NANO config (I use prot's code for modifying C-g, which is normally also included in NANO emacs)

#+begin_src emacs-lisp :tangle "init.el"
(use-package bind-key
  :bind (:map help-map ("y" . describe-personal-keybindings)))

(global-set-key "\C-a" 'back-to-indentation-or-beginning)

(defun steven-close ()
  "Delete frame or kill emacs if there is only one frame left"

  (interactive)
  (condition-case nil
      (delete-frame)
    (error (save-buffers-kill-terminal))))

(bind-key "C-x k" #'kill-current-buffer)
(bind-key "C-x C-c" #'steven-close)
(bind-key "C-x C-r" #'recentf-open)
(bind-key "M-n" #'make-frame)
(bind-key "C-z"  nil) ;; No suspend frame

;; This has to be C-<up> but has issue on macOS.
(bind-key "C-<up>" #'previous-logical-line)
(bind-key "C-<down>" #'next-logical-line)
(bind-key "C-<wheel-up>" nil) ;; No text resize via mouse scroll
(bind-key "C-<wheel-down>" nil) ;; No text resize via mouse scroll
(bind-key "<f2>" #'toggle-input-method)  ; F2 overrides that two-column gimmick.  Sorry, but no!

(bind-key "M-o" #'delete-blank-lines) ; alias for C-x C-o
(bind-key "M-SPC" #'cycle-spacing)
(bind-key "M-z" #'zap-up-to-char) ; NOT `zap-to-char'
(bind-key "M-c" #'capitalize-dwim)
(bind-key "M-l" #'downcase-dwim) ; "lower" case
(bind-key "M-u" #'upcase-dwim) 
(bind-key "M-=" #'count-words)

;;Execute extened command M-x additions
(bind-key "C-x C-m" #'execute-extended-command)
(bind-key "C-c C-m" #'execute-extended-command)
(bind-key "C-x m" nil)
#+end_src

** The =init.el= section on scrolling behaviour

Attempting to make scrolling more smooth. The custom ’scroll half a screen’ commands were copied from Prot, but it does not behave well in org document with folded headings.

#+begin_src emacs-lisp :tangle "init.el"
(setq scroll-conservatively 101 ; affects `scroll-step'
      scroll-margin 0
      auto-window-vscroll t
      scroll-preserve-screen-position t)

(pixel-scroll-precision-mode 1)

(defun steven-scroll--quarter-screen-lines ()
  (max 1 (/ (window-body-height) 4)))

(defun steven-move-down-quarter-screen ()
  (interactive)
  (line-move (steven-scroll--quarter-screen-lines) t))

(defun steven-move-up-quarter-screen ()
  (interactive)
  (line-move (- (steven-scroll--quarter-screen-lines)) t))

(defun steven-scroll-down-quarter-screen ()
  (interactive)
  (scroll-up-command (steven-scroll--quarter-screen-lines)))

(defun steven-scroll-up-quarter-screen ()
  (interactive)
  (scroll-down-command (steven-scroll--quarter-screen-lines)))

(global-set-key (kbd "C-v") #'steven-scroll-down-quarter-screen)
(global-set-key (kbd "M-v") #'steven-scroll-up-quarter-screen)

#+end_src

