config.org
** The =init.el= section to setup the modeline
I use a custom modeline, for which all the backend technicalities are
set in [[*The =steven-modeline.el= section][The =steven-modeline.el= section]]. Here I just
setup the defaults and a toggle function.

The main modeline works, but when using the mode-line-maker function the
box is not drawns as I want. I think I can fix this by reworking [[*The
=steven-modeline.el= section]]. I need to create a seperate custom face
for the active and inactive modeline /with/ a box and have the standard
modeline have /no/ box.

This is a setup using mode-line-maker of Nicolas Rougier (link)
#+begin_src emacs-lisp :tangle "init.el"
(require 'mode-line-maker)
(require 'steven-headerline)
(require 'steven-icons)

(defun steven-headerline-minimal ()
  "Install a modeline using modeline maker"

  (interactive)
  (let* (
         (left  '(
                  (:eval (steven-headerline-buffer-name))
                  " "
                  (:eval (steven-headerline-context))
                  " "))
         (right `((:eval (steven-header-line-right)) "")))
        (setq-default mode-line-format "")
        (setq header-line-format 
              (mode-line-maker left right '(fringe . fringe)))
        (setq-default header-line-format 
                      (mode-line-maker left right '(fringe . fringe)))
        ))

;; This one might work, but I need to have a seperate face for the
;; header-line, e.g. steven-header-line so the :box draws correctly.
(defun steven-headerline-todo ()
  "Install a modeline using modeline maker - not working yet"

  (interactive)
  (let* (
         (left  '((:eval (steven-modeline-major-mode-icon))
                  (:eval (propertize " " 'display '(raise +0.25)))
                  (:eval (steven-headerline-buffer-name))
                  (:eval (propertize " " 'display '(raise -0.25)))
                  (:eval (steven-headerline-context)))
                  )
         (right `((:eval (steven-header-line-right)) "")))
        (setq-default mode-line-format "")
        (setq header-line-format 
              (mode-line-maker left right '(fringe . fringe) t))
        (setq-default header-line-format 
                      (mode-line-maker left right '(fringe . fringe) t))
        ))

(defun steven-headerline-default()
  "Install a headerline using modeline maker"

  (interactive)
    (setq-default mode-line-format "")
    (setq-default header-line-format 
          '(
           (:eval (steven-modeline-major-mode-icon))
           (:eval (propertize " " 'display '(raise -0.25)))
           (:eval (steven-headerline-buffer-name))
           (:eval (propertize " " 'display '(raise +0.25)))
           (:eval (steven-headerline-context))
           (:eval (steven-header-line-align-right))
           (:eval (steven-header-line-right)))))

;;;; Also toggle modeline

(defun steven-modeline-minimal ()
  "Install a modeline using modeline maker, no content"

  (interactive)
  (setq mode-line-format 
      (mode-line-maker "" "" '(window . window) t))
  (setq-default mode-line-format 
      (mode-line-maker "" "" '(window . window) t)))  

(defun steven-modeline-default ()
  "Install a modeline using modeline maker - full version"

  (interactive)
  (let* (
         (left  '((:eval (steven-headerline-major-mode-name))
                  " "
                  (:eval (steven--headerline-git-info))
                  ))

         (right `("( "
                  (:eval (steven--header-line-language))
                  (:eval (steven--modeline-input-method))
                  ;(:eval (steven--modeline-file-size))
                  (:eval (steven-header-line-ispell-dict))
                  ") "
                  (:eval (steven--modeline-cursor-position))
                  )))

        (setq mode-line-format 
              (mode-line-maker left right '(window . window) t))
        (setq-default mode-line-format 
              (mode-line-maker left right '(window . window) t))
        ))

(defvar steven-headerline-style 'default
  "Current header line style.
Can be either 'default or 'minimal.")

(defvar steven-modeline-style 'default
  "Current modeline style.
Can be either 'default or 'minimal.")

(defun steven-apply-headerline ()
  "Apply the current header line style to all buffers."
  (cond
    ((eq steven-headerline-style 'default)
     (steven-headerline-default)
     (steven-apply-spacious-padding-minimal))
    ((eq steven-headerline-style 'minimal)
     (steven-headerline-minimal)
     (steven-apply-spacious-padding-default)))

  (dolist (buf (buffer-list))
     (with-current-buffer buf
       (kill-local-variable 'header-line-format)))
   (force-mode-line-update t)
   (redraw-display))

(defun steven-apply-modeline ()
  "Apply the current modeline style to all buffers."
  (cond
    ((eq steven-modeline-style 'default)
     (steven-modeline-default))
    ((eq steven-modeline-style 'minimal)
     (steven-modeline-minimal))))

;;; Toggle function
(defun steven-toggle-headerline ()
  "Toggle between default and minimal header line styles."
  (interactive)
  (setq steven-headerline-style
        (if (eq steven-headerline-style 'default)
            'minimal
          'default))
  (steven-apply-headerline)
  (message "Headerline style: %s"
           steven-headerline-style))

(defun steven-toggle-modeline ()
  "Toggle between default and minimal modeline styles."
  (interactive)
  (setq steven-modeline-style
        (if (eq steven-modeline-style 'default)
            'minimal
          'default))
  (steven-apply-modeline)
  (message "Modeline style: %s"
           steven-modeline-style))

(setq steven-modeline-style 'default)
(setq steven-headerline-style 'default)
(steven-apply-headerline)
(steven-apply-modeline)
(global-set-key (kbd "<f10>") #'steven-toggle-headerline)
(global-set-key (kbd "<f8>") #'steven-toggle-modeline)
#+end_src

This part takes care of the styling of the headerline. It is important
to turn on spacious padding after the set-custom-face is done, otherwise
it does not work as expected. I just leave spacious padding off by
default and turn it on with a toggle.

#+begin_src emacs-lisp :tangle "init.el"
(defun steven--modus-headerline-faces (&rest _)
  (modus-themes-with-colors
    (custom-set-faces
     `(mode-line-active ((t :underline nil
                            :overline ,fg-main
                            :foreground ,fg-main
                            :box nil
                            :background ,bg-mode-line-inactive
                            :height 1.0)))
     `(mode-line-inactive ((t :underline nil
                              :overline ,fg-main
                              :foreground ,bg-main
                              :box nil
                              :background ,bg-main
                              :height 1.0)))
     `(mode-line-maker-padding-face ((t 
                              :underline nil
                              :foreground ,bg-main
                              :box nil
                              :background ,bg-main)))
     `(header-line ((t 
                            :foreground ,fg-mode-line-active
                            :background ,bg-mode-line-active
                            :box (:line-width 1 :color ,fg-mode-line-active))))
     `(header-line-inactive ((t 
                            :foreground ,fg-mode-line-inactive
                            :background ,bg-mode-line-inactive
                            :box (:line-width 1 :color ,fg-mode-line-inactive))))
     `(header-line-status ((t 
                            :foreground ,fg-mode-line-active
                            :background ,bg-hl-line
                            :box (:line-width 1 :color ,fg-mode-line-active))))
     `(header-line-status-inactive ((t 
                            :foreground ,fg-mode-line-inactive
                            :background ,bg-mode-line-inactive
                            :box (:line-width 1 :color ,fg-mode-line-inactive))))
     )))

(defun steven--doric-headerline-faces (&rest _)
  (doric-themes-with-colors
    (custom-set-faces
     `(mode-line-active ((t :underline nil
                            :overline ,fg-main
                            :foreground ,fg-main
                            :box nil
                            :background ,bg-shadow-subtle
                            :height 1.0)))
     `(mode-line-inactive ((t :underline nil
                              :overline ,bg-main
                              :foreground ,bg-main
                              :box nil
                              :background ,bg-main
                              :height 1.0)))
     `(mode-line-maker-padding-face ((t 
                         :underline nil
                         :foreground ,bg-main
                         :box nil
                         :background ,bg-main)))
     `(steven-header-line ((t 
                            :foreground ,fg-main
                            :background ,bg-shadow-subtle
                            :box (:line-width 1 :color ,fg-main))))
     `(steven-header-line-inactive ((t 
                            :foreground ,fg-shadow-subtle
                            :background ,bg-main
                            :box (:line-width 1 :color ,fg-shadow-subtle))))
     `(header-line ((t 
                            :foreground ,fg-main
                            :background ,bg-shadow-subtle
                            :box (:line-width 1 :color ,fg-main))))
     `(header-line-inactive ((t 
                            :foreground ,bg-neutral
                            :background ,bg-main
                             :box (:line-width 1 :color ,fg-shadow-subtle))))
     `(header-line-status ((t 
                            :foreground ,fg-main
                            :background ,bg-shadow-intense
                            :box (:line-width 1 :color ,fg-main))))
     `(header-line-status-inactive ((t 
                            :foreground ,fg-shadow-subtle
                            :background ,bg-shadow-subtle
                            :box (:line-width 1 :color ,fg-shadow-subtle))))
     )))

;(add-hook 'modus-themes-after-load-theme-hook #'steven--modus-nano-faces)

;(remove-hook 'doric-themes-after-load-theme-hook
;          #'steven--doric-themes-custom-faces)
(add-hook 'doric-themes-after-load-theme-hook
          #'steven--doric-headerline-faces)


;(remove-hook 'modus-themes-after-load-theme-hook
;          #'steven--modus-themes-custom-faces)
(add-hook 'modus-themes-after-load-theme-hook
          #'steven--modus-headerline-faces)

(doric-themes-load-theme 'doric-oak)
#+end_src

** The =init.el= section to load the default theme

I am having some issues with spacious padding and the colour. Currenty
hoping this will help.

#+begin_src emacs-lisp :tangle "init.el"
(doric-themes-load-theme 'doric-oak)
#+end_src

** The =init.el= section setting context var

This is a buffer local variabble I sets via .dir-locals.el. I use this
to add a context indication in the modeline. I can replace this
(probably) by a project name at some point.
#+begin_src emacs-lisp :tangle "init.el"
(defvar steven--context-var nil
  "Buffer-local context variable set via dir-locals, this is purely for the
   modeline to show a context location for my notes folders. This could
   be handled via a directory, but this is a quick fix.")

;(add-to-list 'safe-local-variable-values
;             '((steven--context-var . "Notes")
;               (steven--context-var . "Personal Wiki")))

(progn
  (put 'steven--context-var 'safe-local-variable #'stringp)
  (put 'visual-line-mode 'safe-local-variable #'booleanp)
  (put 'auto-fill-mode 'safe-local-variable #'booleanp))


#+end_src

** The =setup-frame.el= adding a function to toggle frame width

This function is to toggle the width from 'half' to 'wide', it now only
works on mac. I should make it so it changes the width based on the
display size.

#+begin_src emacs-lisp :tangle "init.el"
;;loading the .el file
(use-package setup-frame)
#+end_src

#+begin_src emacs-lisp :tangle "steven/setup-frame.el"
;;; -*- lexical-binding: t -*-

;;;###autoload
(defun steven-frame-recenter (&optional frame)
  "Center FRAME on the screen.
FRAME can be a frame name, a terminal name, or a frame.
If FRAME is omitted or nil, use currently selected frame."
  (interactive)
  (unless (eq 'maximised (frame-parameter nil 'fullscreen))
    (modify-frame-parameters
     frame '((user-position . t) (top . 0.5) (left . 0.5)))))

;;;###autoload
(defun steven-toggle-frame-width ()
  "Toggle between maximized and a fixed pixel-sized frame."
  (interactive)
  (let* ((frame (selected-frame))
         (width 800)
         (height 800)
         (is-maximized
          (eq (frame-parameter frame 'fullscreen) 'maximized)))

    (if is-maximized
        ;; Switch to fixed pixel size
        (progn
          (set-frame-parameter frame 'fullscreen nil)

          ;; t => pixelwise
          (set-frame-size frame width height t)

          (delete-other-windows)
          (message "Switched to %dx%d pixels" width height))

      ;; Switch to maximized
      (progn
        (set-frame-parameter frame 'fullscreen 'maximized)
        (message "Switched to MAXIMIZED mode")))))

(provide 'setup-frame)
;;setup-frame.el end here
#+end_src

** The =init.el= section on the toggle map

This is copied from the config of oantolin

#+begin_src emacs-lisp :tangle "init.el"
(bind-keys :prefix-map toggle-map
           :prefix "C-c t"
           :prefix-docstring "Keymap for commands that toggle settings."
           ("n" . column-number-mode)
           ("d" . toggle-debug-on-error)
           ("f" . fontaine-set-preset)
           ("m" . steven-toggle-modeline)
           ("h" . steven-toggle-headerline)
           ("p" . spacious-padding-mode)
           ("a" . auto-fill-mode)
           ("o" . olivetti-mode)
           ("w" . steven-toggle-frame-width)
           ("i" . whitespace-mode)
           ("v" . visual-line-mode)
           ("i" . visual-fill-column-mode)
           ("c" . center-document-mode)
           ("r" . variable-pitch-mode)
           ("s" . visible-mode))

#+end_src

