config.org
** The =init.el= setup of nerd icons
At first time use you need to do M-x and run `nerd-icons-install-fonts' to get the
font files.  Then restart Emacs to see the effect.

#+begin_src emacs-lisp :tangle "init.el"
(use-package nerd-icons
  :ensure t)
#+end_src

Adds nerd icons to vertico minibuffer output
#+begin_src emacs-lisp :tangle "init.el"
(use-package nerd-icons-completion
  :ensure t
  :after marginalia
  :config
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))
#+end_src

Adds nerd icons to corfu completion list.
#+begin_src emacs-lisp :tangle "init.el"
(use-package nerd-icons-corfu
  :ensure t
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src

Adds nerd icons to dired list
#+begin_src emacs-lisp :tangle "init.el"
(use-package nerd-icons-dired
  :ensure t
  :hook
  (dired-mode . nerd-icons-dired-mode))
#+end_src

** The =init.el= to always start with scratch

#+begin_src emacs-lisp :tangle "init.el"
(setq initial-buffer-choice t)
(setq initial-major-mode 'lisp-interaction-mode)
(setq initial-scratch-message  ";; -*- lexical-binding: t; -*-\n")
#+end_src

** The =steven-scratch.el= section for running a scratch buffer of any mode
A much simpler version from karthinks:
#+begin_src emacs-lisp :tangle "steven/steven-scratch.el"
(use-package scratch
  :ensure t
  :config
  (defun my/scratch-buffer-setup ()
    "Add contents to `scratch' buffer and name it accordingly.
If region is active, add its contents to the new buffer."
    (unless (derived-mode-p
             'text-mode 'prog-mode 'conf-mode 'tex-mode)
      (condition-case nil
          (let ((pick
                 (read-multiple-choice
                  "Switch major mode?"
                  '((?o "org") (?m "markdown")
                    (?l "lisp-interaction") (?e "elisp")
                    (?  "Continue")))))
            (pcase (car pick)
              (?o (org-mode)) (?m (markdown-mode))
              (?l (lisp-interaction-mode)) (?e (emacs-lisp-mode)))
            (read-only-mode 0))
        (quit nil)))
    (when (derived-mode-p 'emacs-lisp-mode)
      (message "Auto-switching to `lisp-interaction-mode'")
      (lisp-interaction-mode))
    (let* ((mode major-mode))
      (rename-buffer (format "*Scratch for %s*" mode) t)))
  (setf (alist-get "\\*Scratch for" display-buffer-alist nil nil #'equal)
        '((display-buffer-same-window)))
  :hook (scratch-create-buffer . my/scratch-buffer-setup)
  :bind ("C-c s" . scratch))
#+end_src

** The =init.el= section on text styling and input

This section sets how text is shown in emacs. 

This sets line wrapping, visual line mode move text to a new line
without actually add a line number. *Currently trying auto-fill-mode*.

Some notes:
- Might not need line truncation
- Weird issue with last character being a truncated symbol: change min window
  size to 81. Might increase further to avoid horizontal scrolling. *Note*: now
  trying a fill-column of 72
- Adaptive-fill-mode is make auto-fill work with lists.
- Prog. elisp mode sometimes requires double space at the end of
  sentence (see prot files) for compiling reasons.
- Use hard newlines nil is to give auto-fill freedom to refill whatever.
  *Note:* I wonder if this can affect dialogues where hard new lines are
  required?

The ’latin-prefix’ input method allows me to type ’e to get é without
using C-x 8.

#+begin_src emacs-lisp :tangle "init.el"
(setq default-input-method "latin-prefix")
(setq-default fill-column 78)

(setq display-line-numbers-type t)
(setq-default truncate-lines nil)
(global-hl-line-mode 1)

;; turn on truncation in prog mode
(use-package text-mode
  :ensure nil
  :hook
  ((text-mode . visual-line-mode)
   (prog-mode . (lambda ()
               (setq-local truncate-lines t)
               (setq-local sentence-end-double-space t))))
  :config
  (setq sentence-end-double-space nil)
  (setq sentence-end-without-period nil)
  (setq colon-double-space nil)
  (setq use-hard-newlines nil)
  (setq adaptive-fill-mode t))

(defun increase-region-font-size (start end &optional factor)
  "Increase the font size of the text in the region by FACTOR (default 1.5). 
   Applies a relative height text property to the selected region."
  (interactive "r")
  (let ((factor (or factor 1.5)))
    (with-silent-modifications
      (add-text-properties start end '(face (:height 1.5))))))

(defun decrease-region-font-size (start end &optional factor)
  "Decrease the font size of the text in the region by FACTOR (default 0.75). 
   Applies a relative height text property to the selected region."
  (interactive "r")
  (let ((factor (or factor 0.75)))
    (with-silent-modifications
      (add-text-properties start end '(face (:height 0.75))))))

(defun reset-region-font-size (start end)
  "Remove custom font size from the region"
  (interactive "r")
  (with-silent-modifications
      (remove-text-properties start end '(face nil))))

(global-set-key (kbd "C-c +") 'increase-region-font-size)
(global-set-key (kbd "C-c -") 'decrease-region-font-size)
(global-set-key (kbd "C-c 0") 'reset-region-font-size)

;;(add-hook 'text-mode-hook 'visual-line-mode) (add-hook 'text-mode-hook 'visual-wrap-prefix-mode)
#+end_src

** TODO The =init.el= section taking care of visual-line-mode

Visual line mode is set in text mode, here there are somesettings taking
care of its looks.

*visual-fill-column* package
*visual-adaptive-fill* package 

#+begin_src emacs-lisp :tangle "init.el"
(use-package visual-fill-column
  :ensure t)
#+end_src

** TODO The =init.el= setting on windows management

A large section on text styling. This is to control where windows pop-up etc.
Note that the 'open link' behaviour of both org links and denote links are done
the respective section. This basically sets the 'open' functio to 'find-file'
instead of 'find-file-other-window'

Inspiration from reddit post: [[https://www.reddit.com/r/emacs/comments/179t67l/window_management_share_your_displaybufferalist/?rdt=53665][Reddit - Please wait for verification]] First, basic setup, inspired by prot

#+begin_src emacs-lisp :tangle "init.el"
(setq split-window-preferred-direction 'horizontal) ; Emacs 31
;;(setq window-combination-resize t)
;;(setq even-window-sizes 'height-only)
;;(setq window-sides-vertical nil)
;;(setq switch-to-buffer-in-dedicated-window 'pop)
(setq split-height-threshold 85)
(setq split-width-threshold 100)
(setq window-min-height 3)
(setq window-min-width 30)
#+end_src

Check [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Buffer-Display-Action-Functions.html][Buffer Display Action Functions (GNU Emacs Lisp Reference Manual)]] buffer-alist setting:

#+begin_src emacs-lisp :tangle "init.el" :result silent
(add-to-list 'display-buffer-alist
             '("\\*e?shell\\*"
               (display-buffer-in-side-window)
               (side . bottom)
               (slot . -1) ;; -1 == L  0 == Mid 1 == R
               (window-height . 0.33) ;; take 2/3 on bottom left
               (window-parameters
                (no-delete-other-windows . nil))))
(add-to-list 'display-buffer-alist
             '("\\*\\(Backtrace\\|Compile-log\\|Messages\\|Warnings\\)\\*"
               (display-buffer-in-side-window)
               (side . bottom)
               (slot . 0)
               (window-height . 0.33)
               (window-parameters
                (no-delete-other-windows . nil))))

(add-to-list 'display-buffer-alist
           '("\\*\\(Org \\(Select\\|Note\\)\\|Agenda Commands\\)\\*" ; the `org-capture' key selection and `org-add-log-note'
           (display-buffer-in-side-window)
           (dedicated . t)
           (side . bottom)
           (slot . 0)
           (window-parameters . ((mode-line-format . none)))))
             
;(add-to-list 'display-buffer-alist
;             '("\\*\\([Hh]elp\\|Command History\\|command-log\\)\\*"
;               (display-buffer-in-side-window)
;               (side . right)
;               (slot . 0)
;               (window-parameters
;                (no-delete-other-windows . nil))))

(setq help-window-select t)  ;; automatically focus help window

(add-to-list 'display-buffer-alist
             '("\\*TeX errors\\*"
               (display-buffer-in-side-window)
               (side . bottom)
               (slot . 3)
               (window-height . shrink-window-if-larger-than-buffer)
               (dedicated . t)))

(add-to-list 'display-buffer-alist
             '("\\*TeX Help\\*"
               (display-buffer-in-side-window)
               (side . bottom)
               (slot . 4)
               (window-height . shrink-window-if-larger-than-buffer)
               (dedicated . t)))

(add-to-list 'display-buffer-alist
             '("\\`\\*\\(Warnings\\|Compile-Log\\)\\*\\'"
               (display-buffer-in-side-window)
               (side . bottom)
               (slot . 0)))


(add-to-list 'display-buffer-alist
             '("\\*Word Etymology\\*"
               (display-buffer-in-side-window)
               (side . right)
               (window-width . 0.4    )
               (dedicated . t)))
#+end_src

** The =init.el= setting on semantic lines

This code is copied from: [[https://sachachua.com/blog/2025/09/emacs-cycle-through-different-paragraph-formats-all-on-one-line-wrapped-max-one-sentence-per-line-one-sentence-per-line/][Emacs: Cycle through different paragraph formats: all on one line, wrapped, m...]]
#+begin_src emacs-lisp :tangle "init.el"

(defun my-unfill-paragraph ()
  "Replace newline chars in current paragraph by single spaces.
This command does the inverse of `fill-paragraph'"
  (interactive)
  (let ((fill-column most-positive-fixnum))
    (fill-paragraph)))

(defun my-fill-paragraph-semlf-long ()
  (interactive)
  (let ((fill-column most-positive-fixnum))
    (fill-paragraph-semlf)))

;; It might be nice to figure out what state we're in and then cycle to the next one if we're just working with a single paragraph. In the meantime, just going by repeats is fine.
(defvar my-cycle-functions
  '(fill-paragraph
    my-unfill-paragraph
    my-fill-paragraph-semlf-long)
  "Functions to cycle through.")

(defvar my-cycle-index 0
  "Current position in `my-cycle-functions`.")

(defun my-cycle-paragraph ()
  "Cycle through paragraph formatting functions on repeated calls."
  (interactive)
  (unless (eq last-command this-command)
    (setq my-cycle-index 0))
  (let ((fn (nth my-cycle-index my-cycle-functions)))
    (when fn
      (call-interactively fn)
      (message "Ran: %s" fn)))
  (setq my-cycle-index
        (mod (1+ my-cycle-index)
             (length my-cycle-functions))))

(keymap-global-set "M-q" #'my-cycle-paragraph)

#+end_src

Working on a minor mode: semlf mode
#+begin_src emacs-lisp :tangle "init.el"
(defun steven-org-content-start ()
  "Return position after Org front matter (#+ lines)."
  (save-excursion
    (goto-char (point-min))
    (while (looking-at-p "^#\\+")
      (forward-line 1))
    (point)))

(defun steven-unfill-buffer ()
  "Unfill the buffer, excluding Org front matter."
  (interactive)
  (let ((fill-column most-positive-fixnum))
    (fill-region (steven-org-content-start) (point-max))))

(defun steven-fill-buffer-semlf ()
  "Apply `fill-paragraph-semlf` to all paragraphs after front matter."
  (interactive)
  (save-excursion
    (let ((fill-column most-positive-fixnum))
      (goto-char (steven-org-content-start))
      (while (< (point) (point-max))
        ;; Skip headings and empty lines
        (cond
         ((org-at-heading-p)
          (forward-line 1))
         ((looking-at-p "^\\s-*$")
          (forward-line 1))
         (t
          ;; Now we're in actual paragraph content
          (fill-paragraph-semlf)
          (forward-paragraph 1)))))))

(define-minor-mode OSPV-mode
  "One Sentence Per Visual-line mode (Org buffers only)."
  :lighter " OSPV"
  (unless (derived-mode-p 'org-mode)
    (user-error "OSPV-mode only works in org-mode"))
  (if OSPV-mode
      (steven-fill-buffer-semlf)
    (steven-unfill-buffer)))

;; Set to t (non-nil) when entering org, not toggle DO NOT turn this on globablly, only in /Notes via .dir-locals
;(add-hook 'org-mode-hook (lambda () (OSPV-mode t)))

(with-eval-after-load 'org
  (define-key org-mode-map (kbd "<f6>") #'OSPV-mode))
#+end_src

** The =init.el= setting to delete inserted text
#+begin_src emacs-lisp :tangle "init.el"
(use-package delsel
  :ensure nil
  :hook (after-init . delete-selection-mode))

#+end_src

** The =init.el= section to setup goto-chg

#+begin_src emacs-lisp :tangle "init.el"
(use-package goto-chg
  :ensure t
  :bind (("C-(" . goto-last-change)
         ("C-)" . goto-last-change-reverse)))
#+end_src

** The =init.el= to setup trash for deleted files
#+begin_src emacs-lisp :tangle "init.el"
(use-package trashed
  :ensure t
  :commands (trashed)
  :config
  (setq trashed-action-confirmer 'y-or-n-p)
  (setq trashed-use-header-line t)
  (setq trashed-sort-key '("Date deleted" . t))
  (setq trashed-date-format "%Y-%m-%d %H:%M:%S"))
#+end_src

