config.org
** TODO The =init.el= section on isearch

This is entirely copied from the config of Prot. More info can be found
there. I have kept some of his documentation below.

#+begin_src emacs-lisp :tangle "init.el"

(setq search-whitespace-regexp ".*?")
(setq isearch-lax-whitespace t)
(setq isearch-regexp-lax-whitespace nil)
(setq isearch-wrap-pause t) ; `no-ding' makes keyboard macros never quit
(setq isearch-repeat-on-direction-change t)
(setq search-highlight t)
(setq isearch-lazy-highlight t)
(setq lazy-highlight-initial-delay 0.5)
(setq lazy-highlight-no-delay-length 4)
(setq isearch-lazy-count t)
(setq lazy-count-prefix-format "(%s/%s) ")
(setq lazy-count-suffix-format nil)
#+end_src

The first thing I want to do for Isearch, is make it more convenient
for me to match words that occur in sequence but are not necessarily
following each other. By default, we can do that with something like
=C-M-s= (~isearch-forward-regexp~) followed by =one.*two=. Though it
is inconvenient to be a regexp-aware search mode when all we want is
to just type =one two= and have the space be interpreted as
"intermediate characters" rather than a literal space. The following
do exactly this for regular =C-s= (~isearch-forward~) and =C-r=
(~isearch-backward~).

*Text from Prots config for reference:*
Here I am just tweaking the delay that affects when deferred
highlights are applied. The current match is highlighted immediately.
The rest are done after ~lazy-highlight-initial-delay~ unless they are
longer in character count than ~lazy-highlight-no-delay-length~.

I think the following options should be enabled by default. They
produce a counter next to the isearch prompt that shows the position
of the current match relative to the total count (like =5/20=). As we
move to the next/previous match, the counter is updated accordingly.
We have the option to place this information after the search terms,
though I prefer to have them as a prefix so as not to interfere with
what I am typing.
  

** The =init.el= setup of dired

- I turn on hide details because I dont need info on permission etc., it can be toggled when needed.
- hl-line-mode: this makes the current line always highlighted
- By default the icons are shown, which is setup in [[*Theme and nerd icons setup][Theme and nerd icons setup]]

#+begin_src emacs-lisp :tangle "init.el"
(use-package dired
    :ensure nil
    :commands (dired)
    :hook
    ((dired-mode . dired-hide-details-mode)
     (dired-mode . hl-line-mode)
     (dired-mode . dired-omit-mode))
    :config
    (setq dired-free-space nil)
    (setq dired-hide-details-hide-information-lines t)
    (setq dired-recursive-copies 'always)
    (setq dired-recursive-deletes 'always)
    (setq delete-by-moving-to-trash t)
    (setq dired-dwim-target t)
    (setq dired-listing-switches "-alh --group-directories-first")
    (use-package dired-x
       :ensure nil  ;; also built-in
       :config
       (setq dired-omit-files
            (concat dired-omit-files
             "\\|^\\.DS_Store$"
             "\\|^\\.stfolder$"
             "\\|^\\.localized$"))))

(defun steven--dired-layout ()
  "Custom behaviors for dired layout."
  ;; First remove the entire header line:
  ;(save-excursion
  ;  (goto-char (point-min))
  ;  (put-text-property
  ;   (line-beginning-position)
  ;   (1+ (line-end-position))
  ;   'invisible t))
  ;;truncate-lines is buffer local, so can be safely changed
  (setq truncate-lines t))


;; The following appends it to the hook list at the end
(add-hook 'dired-mode-hook #'steven--dired-layout t)

(defun steven--dired-rename-buffer ()
 "Rename Dired buffers to their directory name."
  (when (derived-mode-p 'dired-mode)
    (rename-buffer
     (abbreviate-file-name
      (expand-file-name dired-directory))
     t)))

;(add-hook 'dired-mode-hook #'steven--dired-rename-buffer)

(defvar steven-dired--limit-hist '()
  "Minibuffer history for `steven-dired-limit-regexp'.")

;; Function from Prot:
(defun steven-dired-limit-regexp (regexp omit)
  "Limit Dired to keep files matching REGEXP.

With optional OMIT argument as a prefix (\\[universal-argument]),
exclude files matching REGEXP.

Restore the buffer with \\<dired-mode-map>`\\[revert-buffer]'."
  (interactive
   (list
    (read-regexp
     (concat "Files "
             (when current-prefix-arg
               (propertize "NOT " 'face 'warning))
             "matching PATTERN: ")
     nil 'steven-dired--limit-hist)
    current-prefix-arg))
  (dired-mark-files-regexp regexp)
  (unless omit (dired-toggle-marks))
  (dired-do-kill-lines)
  (add-to-history 'steven-dired--limit-hist regexp))

#+end_src

** The =init.el= section on dired-subtree
Dired subtree is to show subtrees of folder with TAB
#+begin_src emacs-lisp :tangle "init.el"
(use-package dired-subtree
  :ensure t
  :after dired
  :bind
  ( :map dired-mode-map
    ("<tab>" . dired-subtree-toggle)
    ("TAB" . dired-subtree-toggle)
    ("<backtab>" . dired-subtree-remove)
    ("S-TAB" . dired-subtree-remove))
  :config
  (setq dired-subtree-use-backgrounds nil))
#+end_src

** The =init.el= section on dired-preview
#+begin_src emacs-lisp :tangle "init.el"
(use-package dired-preview
    :ensure t
    :config
    (setq dired-preview-delay 0.3)
    (setq dired-preview-inline t)
    (setq dired-preview-image-types '("png" "jpg" "jpeg" "gif"))
    (define-key dired-mode-map (kbd "C-c C-p") 'dired-preview-file)
    (setq dired-preview-auto-preview t)
    (setq dired-preview-max-size (expt 2 20))
    (setq dired-preview-ignored-extensions-regexp
          (concat "\\."
                  "\\(gz\\|"
                  "zst\\|"
                  "tar\\|"
                  "xz\\|"
                  "rar\\|"
                  "zip\\|"
                  "iso\\|"
                  "epub"
                  "\\)")))

#+end_src

** The =dired-extras.el= section defining custom dired functions

This part is copied from the config of Prot, this can be used to limit
Dired to a regexp query. Sometimes usefull.

#+begin_src emacs-lisp :tangle "steven/dired-extras.el"
;;; -*- lexical-binding: t -*-

(defvar steven-dired--limit-hist '()
  "Minibuffer history for `prot-dired-limit-regexp'.")

;;;###autoload
(defun steven-dired-limit-regexp (regexp omit)
  "Limit Dired to keep files matching REGEXP.

With optional OMIT argument as a prefix (\\[universal-argument]),
exclude files matching REGEXP.

Restore the buffer with \\<dired-mode-map>`\\[revert-buffer]'."
  (interactive
   (list
    (read-regexp
     (concat "Files "
             (when current-prefix-arg
               (propertize "NOT " 'face 'warning))
             "matching PATTERN: ")
     nil 'steven-dired--limit-hist)
    current-prefix-arg))
  (dired-mark-files-regexp regexp)
  (unless omit (dired-toggle-marks))
  (dired-do-kill-lines)
  (add-to-history 'steven-dired--limit-hist regexp))

(provide 'dired-extras)
;;dired-extras.el end here
#+end_src

Custom function to pop dired in left pane at default directory of
current file. I do not use this at the moment.

#+begin_src emacs-lisp :tangle "init.el"
(defun steven-dired-here-side-left ()
  "Open Dired for current buffer's directory in a left side window."
  (interactive)
  (let* ((dir (or (and (buffer-file-name)
                       (file-name-directory (buffer-file-name)))
                  default-directory))
         (buffer (dired-noselect dir)))
    (display-buffer
     buffer
     '((display-buffer-in-direction)
      (direction . left)
      (window-width . 0.25)) 
                                )))
#+end_src


** The =init.el= section to setup colorful mode

#+begin_src emacs-lisp :tangle "init.el"
(use-package colorful-mode
  ;; :diminish
  :ensure t ; Optional
  :custom
  (colorful-use-prefix t)
  (colorful-prefix-string " ")
  (colorful-only-strings 'only-prog)
  (css-fontify-colors nil)
  :config
  (global-colorful-mode t)
  (add-to-list 'global-colorful-modes 'helpful-mode))

#+end_src

** This =init.el= section on languages 

I am creating my own mode to set the ’system language’. It should set
the following default:
- flyspell 
- wiktionary bro
- dictionary?
- gptel system prompt

#+begin_src emacs-lisp :tangle "init.el"
(defvar steven--current-language 'english
  "Current system language.")

(defun steven--apply-language-settings ()
  "Apply settings for `my/current-language`."
  (pcase steven--current-language

    ('english
     ;; Spell checking
     (setq ispell-change-dictionary "en_GB")
     (setq wiktionary-bro-language "en")
     ;; Example future settings:
     ;; (setq some-var ...)
     ;; (setenv "LANG" "en_US.UTF-8")

     (message "Language set to English"))

    ('dutch
     ;; Spell checking
     (setq ispell-change-dictionary "nl_NL")
     (setq wiktionary-bro-language "nl")
     ;; Example future settings:
     ;; (setq some-var ...)
     ;; (setenv "LANG" "nl_NL.UTF-8")

     (message "Language set to Dutch"))))

(defun steven-toggle-language ()
  "Toggle between English and Dutch."
  (interactive)
  (setq steven--current-language
        (if (eq steven--current-language 'english)
            'dutch
          'english))

  (steven--apply-language-settings))

(bind-key "C-<f7>" #'steven-toggle-language)
#+end_src

** The =init.el= setup of the dictionary

- The gcide dictionary specifically pulls from Webster's 1913 content. If you omit the dictionary-default-dictionary setting, you'll get results from all available dictionaries on dict.org (including Webster's).

- Interactive search: Run M-x dictionary-search RET (or your custom keybinding like C-c d), enter a word (e.g., "serendipity"), and press Enter. Results appear in a new buffer with definitions, etymology, and hyperlinks for related words.
- Lookup word at point: Position your cursor on a word and run M-x dictionary-lookup-definition. This queries the default dictionary (GCIDE/Webster's).
- Match/regex search: Use M-x dictionary-match for partial matches (e.g., "seren*").

The results buffer supports navigation: hyperlinks (e.g., for synonyms or related terms) are clickable, and you can browse history with dictionary-previous/dictionary-next.

#+begin_src emacs-lisp :tangle "init.el"
;; Set the default server to dict.org (avoids prompting each time)
(setq dictionary-server "dict.org")

;; Optional: Set default dictionary to GCIDE for Webster's 1913
(setq dictionary-default-dictionary "gcide")

;; Optional: Bind a key for quick lookups (e.g., on the current word at point)
(global-set-key (kbd "C-c d") #'dictionary-search)


#+end_src

** The =init.el= section on writing tools

I am  with some tools:
- define-word
- wiktionary-bro

#+begin_src emacs-lisp :tangle "init.el"
(use-package wiktionary-bro
  :ensure t)

(use-package define-word
  :ensure t)
#+end_src

** The =init.el= section to setup spell-checking

For spell checking I use hunspell, both for Linux (dnf) and macOS
(brew). Dutch and English spelling libraries need to be added. Current
dictionaries available by hunspell are listed with the following
command:

#+begin_src bash
hunspell -D
#+end_src

Guide on setting up spelling: [[file:~/Documents/Wiki/20260530T094754--setting-up-spelling-libraries-in-linux__linux_manual.org][link]] My emacs functions expect *nl_NL* and
*en_GB* libraries to be installed.

I have installed the dictionaries via dnf, other sources:
- nl_NL dictionaries from opentaal.nl: [[https://github.com/OpenTaal/opentaal-hunspell][GitHub - OpenTaal/opentaal-hunspell]]
- en_GB dictionaries: [[https://github.com/marcoagpinto/aoo-mozilla-en-dict][GitHub - marcoagpinto/aoo-mozilla-en-dict: English Dictionaries Project]]

Dictionary files should be placed in: 
- *Linux*: /usr/share/hunspell.
- *macOS*: ~/Library/Spelling. 

Important command: C-; to autocorrect previous word before point. Middle
click to correct a marked word. M-$ to open context menu for word on
point. I have turned off the automatic hook to text mode, such that I
can activate it myself.

To useflyspell on the entire buffer, run ’flyspell-buffer’

#+begin_src emacs-lisp :tangle "init.el"
;; Use Hunspell as the spell-checker
(when (executable-find "hunspell")
  (setq-default ispell-program-name "hunspell")
  (setq ispell-really-hunspell t))

(with-eval-after-load 'flyspell
  (define-key flyspell-mode-map (kbd "C-.") nil))

;; Default to Dutch
(setq ispell-dictionary "nl_NL")
(setq flyspell-default-dictionary "nl_NL")

;; Tell Emacs where to find the dictionaries (optional if auto-detected)
(setq ispell-local-dictionary-alist
      '(("en_GB" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_GB") nil utf-8)
        ("nl_NL" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "nl_NL") nil utf-8)))

;(add-hook 'text-mode-hook 'flyspell-mode)

;obsolete
(defun steven-toggle-spell-language ()
  "Toggle between English and Dutch Hunspell dictionaries."
  (interactive)
  (let ((current-dict ispell-current-dictionary))
    (cond
     ((string= current-dict "en_GB")
      (ispell-change-dictionary "nl_NL")
      (message "Switched dictionary to Dutch (nl_NL)"))
     ((string= current-dict "nl_NL")
      (ispell-change-dictionary "en_GB")
      (message "Switched dictionary to English (en_GB)"))
     (t
      (ispell-change-dictionary "en_GB")
      (message "Defaulted dictionary to English (en_GB)")))))

(bind-key "<f7>" #'flyspell-mode)
#+end_src

** The =init.el= section to setup codeblock behaviour

This fixes the annoying tab behaviour in code blocks, from Prots setup

#+begin_src emacs-lisp :tangle "init.el"
(with-eval-after-load 'org
  (setq org-confirm-babel-evaluate nil)
  (setq org-src-window-setup 'current-window)
  (setq org-edit-src-persistent-message nil)
  (setq org-src-fontify-natively t)
  (setq org-src-preserve-indentation t)
  (setq org-src-tab-acts-natively t)
  (setq org-edit-src-content-indentation 0))
#+end_src

** The =init.el= to relocate auto-save files

Normally auto-save files (which I find usefull) are saved in the same folder as the edited file. This then also shows up in consult-find, fd and grep, which is annoying. Now they are stored in a given folder.

I think this is causing issues!
Need to check

#+begin_src emacs-lisp :tangle "init.el"

;; Redirect auto-saves
(setq auto-save-file-name-transforms
      `((".*" "~/.config/emacs/auto-saves/\\1" t)))

#+end_src

** The =init.el= section on repeat mode

The ~repeat-mode~ is designed to find when a "repeatable" command is
called and arrange so that it can be called again with single key
press. A case in point is the ~other-window~ command, bound to =C-x o=
by default. With ~repeat-mode~ enabled, we can type =C-x o= to invoke
the command and then type =o= to call it again. So =C-x o o o= runs
~other-window~ three times. This is quite convenient.


#+begin_src emacs-lisp :tangle "init.el"
;;;; Repeatable key chords (repeat-mode)
(repeat-mode 1)
(setq set-mark-command-repeat-pop t)
#+end_src

