config.org
** The =init.el= section to setup search with consult
Essential package for searching etc. From Prot's config: The `consult' package
provides lots of commands that are enhanced variants of basic, built-in
functionality. One of the headline features of `consult' is its preview
facility, where it shows in another Emacs window the context of what is
currently matched in the minibuffer.

#+BEGIN_SRC emacs-lisp :tangle "init.el"
(use-package consult
  :ensure t
  :bind
  ("M-y" . consult-yank-pop)
  ("M-X" . consult-mode-command)
  ("C-c b" . consult-buffer)
  ("C-c C-b" . consult-buffer)
  ("C-c 4 b" . consult-buffer-other-window)
  ("C->" . consult-register-store)
  ("C-," . consult-register-load)
  ("C-M-," . consult-register)
  (:map goto-map
        ("l" . consult-line)
        ("M-l" . consult-line)
        ("L" . consult-line-multi)
        ("i" . consult-imenu)
        ("o" . consult-outline)
        ("a" . consult-org-agenda)
        ("I" . consult-imenu-multi)
        ("m" . consult-mark)
        ("k" . consult-global-mark)
        ("h" . consult-org-heading))
  (:map search-map
        ("f" . consult-find)
        ("M-f" . consult-find)
        ("s" . consult-outline)
        ("M-s" . consult-outline)
        ("g" . consult-grep)
        ("G" . consult-git-grep)
        ("r" . consult-ripgrep)
        ("i" . consult-info)
        ("K" . consult-keep-lines)
        ("F" . consult-focus-lines))
  (:map minibuffer-local-map
        ("M-h" . consult-history)
        ("M-r") ("M-s"))
  (:map consult-narrow-map
        ("C-<" . consult-narrow-help))
  (:map isearch-mode-map
        ("M-g l" . consult-line))
  :config
  (setq consult-line-numbers-widen t)
  (setq consult-async-min-input 3)
  (setq consult-async-input-debounce 0.5)
  (setq consult-async-input-throttle 0.8)
  ;; Below are all the standard buffer sources for C-x b. 
  ;; I just moved the bookmarks up to have them listed earlier
  (setq consult-buffer-sources
        '(consult-source-buffer
          consult-source-hidden-buffer
          consult-source-modified-buffer
          consult-source-bookmark
          consult-source-other-buffer
          consult-source-recent-file
          consult-source-buffer-register
          consult-source-file-register 
          consult-source-project-buffer-hidden
          consult-source-project-recent-file-hidden
          consult-source-project-root-hidden))
  (add-to-list 'consult-preview-allowed-hooks 'visual-line-mode)
  (setq consult-find-args
        (concat "find . -not ( "
                "-path */.git* -prune "
                "-or -path */.cache* -prune )"))
  (setq consult-preview-key '(:debounce 0.4 any))
  (consult-customize
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-buffer consult-outline
   :preview-key "M-.")
  ;; Preview after a short delay
  (consult-customize
   consult-find
   :preview-key '(:debounce 0.3 any))
  :custom
   (completion-in-region-function #'consult-completion-in-region)
   (register-preview-function #'consult-register-format)
   (consult-narrow-key "<"))

;; Consult with orderless (from consult wiki)
;(use-package consult
;  :disabled
;  :after orderless
;  :defer
;  :config
;  (defun consult--orderless-regexp-compiler (input type &rest _config)
;    (setq input (orderless-pattern-compiler input))
;    (cons
;     (mapcar (lambda (r) (consult--convert-regexp r type)) input)
;     (lambda (str) (orderless--highlight input t str)))))

(use-package consult-extras
  )
#+end_src

** The =init.el= section on custom consult functions (OLD)

These are wrapper functions;
- steven--consult-wrapper is used in consult-dir to make sure preview works
- steven--consult-wrapper-denote is used to customize the denote prompt. The
  denote prompt should show All Notes and not the current project that consult
  finds by itself. This is because I set multple directories as my denote
  directory. The way to do this is to create an alias function and set the
  :prompt to the desired string. I have to set :state aswell.

*Note: I have moved these into consult-dir and consult-denote calls*
The important detail is that consult-find has this signature:
#+begin_src
(&optional dir initial).
#+end_src

Various Consult internals inspect command identity and arguments together.
Aliasing can confuse that machinery in subtle ways.
A wrapper function avoids the issue entirely.

You also no longer need: (let ((this-command ...)) because now the
command symbol is genuinely steven-consult-find-notes. Newer versions of
Consult added explicit :command plumbing internally to reduce reliance
on this-command, because alias/wrapper edge cases kept showing up

** The =init.el= section on consult-notes

Not in use at the moment.

#+begin_src emacs-lisp :tangle "init.el"
(use-package consult-notes
  :ensure t
  :commands (consult-notes
             consult-notes-search-in-all-notes)
  :config
  ;(setq consult-notes-file-dir-sources '(("Wiki" ?h "~/Documents/Wiki/")))
  ;(setq consult-notes-org-headings-files '("~/Documents/Org/agenda.org"
  ;                                         "~/Documents/Org/projects.org"))

  (when (locate-library "denote")
    (consult-notes-denote-mode)))
#+end_src

This can also be run from the minibuffer, almost like a mini version of
embark. 

#+begin_src emacs-lisp :tangle "init.el"
(use-package consult-dir
  :ensure t
  :after consult
  :bind (("C-x C-d" . consult-dir)
         :map minibuffer-local-completion-map
         ("C-x C-d" . consult-dir)
         ("C-x C-j" . consult-dir-jump-file))
  :config
  (defun steven--consult-wrapper (&optional dir initial)
    "A wrapper function for consult-find, so preview is active"
    (interactive)
    (let ((this-command 'steven--consult-wrapper))
      (consult-find dir initial)))

  (consult-customize
   steven--consult-wrapper
   :state (consult--file-preview))
  (setq consult-dir-default-command #'steven--consult-wrapper))
  ;;(consult-customize
  ;;   consult-find
  ;;   :preview-key '(:debounce 0.4 any)))

#+end_src

** The =init.el= section to setup denote

Currently the directory is set as /Documents/notes, I can include all
subdirectory by add 'expand-tree' or so before the dir. Check Prot's setup for
that.

The package is loaded directly from the git repo, which can be upgraded with /package-vc-upgrade-all/
#+begin_src emacs-lisp :tangle "init.el"
(use-package denote
    :vc (:url "https://github.com/protesilaos/denote")
    :hook
    ;; If you use Markdown or plain text files you want to fontify links
    ;; upon visiting the file (Org renders links as buttons right away).
    ((text-mode . denote-fontify-links-mode-maybe)
     ;; Highlight Denote file names in Dired buffers.  Below is the
     ;; generic approach, which is great if you rename files Denote-style
     ;; in lots of places as I do.
     ;;
     ;; If you only want the `denote-dired-mode' in select directories,
     ;; then modify the variable `denote-dired-directories' and use the
     ;; following instead:
     ;;
     ;;  (dired-mode   . denote-dired-mode-in-directories)
     (dired-mode . denote-dired-mode))
    :bind
    ;; Denote DOES NOT define any key bindings.  This is for the user to
    ;; decide.  Here I only have a subset of what Denote offers.
    ( :map global-map
      ("C-c n F" . consult-notes)
      ("C-c n n" . steven-denote-notes)
      ("C-c n w" . steven-denote-wiki)
      ("C-c n N" . denote-type)
      ("C-c n d" . denote-sort-dired)
      ;; Note that `denote-rename-file' can work from any context, not
      ;; just Dired buffers.  That is why we bind it here to the
      ;; `global-map'.
      ;;
      ;; Also see `denote-rename-file-using-front-matter' further below.
      ("C-c n r" . denote-rename-file)
      ("C-c n k" . denote-rename-file-keyword)
      ("C-c n s" . denote-signature)
      ;; If you intend to use Denote with a variety of file types, it is
      ;; easier to bind the link-related commands to the `global-map', as
      ;; shown here.  Otherwise follow the same pattern for
      ;; `org-mode-map', `markdown-mode-map', and/or `text-mode-map'.
      :map org-mode-map
       ("C-c n i" . denote-link) ; "insert" mnemonic
       ("C-c n I" . denote-add-links)
       ("C-c n b" . denote-backlinks)
       ("C-c n R" . denote-rename-file-using-front-matter)
      ;; Key bindings specifically for Dired.
      :map dired-mode-map
      ("C-c C-d C-i" . denote-dired-link-marked-notes)
      ("C-c C-d C-r" . denote-dired-rename-marked-files)
      ("C-C C-d C-k" . denote-dired-rename-marked-files-with-keywords)
      ("C-c C-d C-f" . denote-dired-rename-marked-files-using-front-matter))
    :config
    ;; Remember to check the doc strings of those variables.
    (setq denote-directory "~/Documents/Notes/")
    (setq denote-prompts '(title keywords))
    ;; If you want to have a "controlled vocabulary" of keywords,
    ;; meaning that you only use a predefined set of them, then you want
    ;; `denote-infer-keywords' to be nil and `denote-known-keywords' to

    ;; have the keywords you need.
    (setq denote-known-keywords '("emacs" "idea" "note" "recipe" "bikes" "config"))
    (setq denote-infer-keywords t)
    (setq denote-sort-keywords t)
    (setq denote-rename-confirmations nil)
    (setq denote-buffer-name-prefix "") ; to identify all Denote buffers
    (setq denote-rename-buffer-format "%D")
    (setq denote-open-link-function #'find-file)
    (denote-rename-buffer-mode 1))

(require 'denote)
#+end_src 


** The =denote-extras.el= section on custom denote functions

#+begin_src emacs-lisp :tangle "init.el"
(use-package steven-denote-extras)
#+end_src

Not tangled yet, need to check dependency on denote

#+begin_src emacs-lisp :tangle "steven/steven-denote-extras.el"
;;; -*- lexical-binding: t -*-

;;;###autoload
(defun steven-denote-create-note-in-any-directory ()
  "Create new Denote note in any directory.
Prompt for the directory using minibuffer completion."
  (declare (interactive-only t))
  (interactive)
  (let ((denote-directory (read-directory-name "New note in: " nil nil :must-match)))
    (call-interactively 'denote)))

;;;###autoload
(defun steven-denote-notes ()
  "Like `denote' but always use the ~/Documents/Notes/ directory."
  (interactive)
  (let ((denote-use-directory "~/Documents/Notes")
        (denote-use-prompts '(title keywords)))
    (call-interactively 'denote)))

;;;###autoload
(defun steven-denote-wiki ()
  "Like `denote' but always use the ~/Documents/Wiki/ directory."
  (interactive)
  (let ((denote-directory "~/Documents/Wiki")
        (denote-use-prompts '(title keywords)))
    (call-interactively 'denote)))

;;;###autoload
(defun steven-insert-relative-link ()
  "Use `denote-find` to select a Denote file, then insert a relative Org
link without a description."
  (interactive)
  (let* ((file (denote-file-prompt))
         (relative (file-relative-name file default-directory)))
    (insert (format "[[file:%s]]" relative))))

(provide 'steven-denote-extras)
;;steven-denote-extras.el ends here
#+end_src

** The =init.el= section on denote-consult

This make Denote Buffers have their own section in consult-buffer.
Consult-denote-find searches in note folder. Cannot also be setup to include
denote silos (check manual). Also check out consult-note: [[https://github.com/mclear-tools/consult-notes][consult-note GitHub
Page ]]

#+begin_src emacs-lisp :tangle "init.el"
(use-package consult-denote
  :ensure t
  :bind
  (("C-c n f" . consult-denote-find)
   ("C-c n g" . consult-denote-grep))
  :config
  (defun steven-consult-find-notes (&optional dir initial)
    (consult-find dir initial))

  (consult-customize
     steven-consult-find-notes
     :state (consult--file-preview)
     :prompt "Find (All Notes): ")

  (setq consult-denote-find-command #'steven-consult-find-notes)
  (consult-denote-mode 1))
#+end_src

** The =init.el= section on denote-org

#+begin_src emacs-lisp :tangle "init.el"
(use-package denote-org
  :ensure t
  :commands
  ;; I list the commands here so that you can discover them more
  ;; easily.  You might want to bind the most frequently used ones to
  ;; the `org-mode-map'.
  ( denote-org-link-to-heading
    denote-org-backlinks-for-heading

    denote-org-extract-org-subtree

    denote-org-convert-links-to-file-type
    denote-org-convert-links-to-denote-type

    denote-org-dblock-insert-files
    denote-org-dblock-insert-links
    denote-org-dblock-insert-backlinks
    denote-org-dblock-insert-missing-links
    denote-org-dblock-insert-files-as-headings))
#+end_src

#+begin_src emacs-lisp :tangle "init.el"
(use-package denote-silo
  :vc (:url "https://github.com/protesilaos/denote-silo")
  :ensure nil
  ;; Bind these commands to key bindings of your choice.
  :commands ( denote-silo-create-note
              denote-silo-open-or-create
              denote-silo-select-silo-then-command
              denote-silo-dired
              denote-silo-cd )
  :config
  ;; Add your silos to this list.  By default, it only includes the
  ;; value of the variable `denote-directory'.
  (setq denote-silo-directories
        (list denote-directory
              "~/Documents/Notes/"
              "~/Documents/Wiki/"
              "~/Documents/Recipebook/Recipes")))
#+end_src


** The =init.el= section on denote-journal

#+begin_src emacs-lisp :tangle "init.el"
(use-package denote-journal
  :ensure t
  ;; Bind those to some key for your convenience.
  :commands ( denote-journal-new-entry
              denote-journal-new-or-existing-entry
              denote-journal-link-or-create-entry
              steven/denote-writingclass-entry )
  :hook (calendar-mode . denote-journal-calendar-mode)
  :config
  ;; Use the "journal" subdirectory of the `denote-directory'.  Set this
  ;; to nil to use the `denote-directory' instead.
  (setq denote-journal-directory
        (expand-file-name "Journal" denote-directory))
  ;; Default keyword for new journal entries. It can also be a list of
  ;; strings.
  (setq denote-journal-keyword "journal")
  ;; Read the doc string of `denote-journal-title-format'.
  (setq denote-journal-title-format 'day-date-month-year)
  (defun steven/denote-writingclass-entry ()
    (interactive)
    (let ((internal-date (current-time)))
      (denote
       (denote-journal-daily--title-format internal-date)
       '("writingclass")
       nil nil nil nil nil))))

#+end_src

