config.org
** The =steven-icons.el= section of steven-icons.el

This is copied from Prots config. This need to be put in a seperate
.el file so I can require it before the first setting of the header
line, where this function is already needed.

#+begin_src emacs-lisp :tangle "steven/steven-icons.el"
;;; -*- lexical-binding: t -*-

(defvar steven-icons-symbolic
  '((dired-mode "  " steven-icons-directory)
    (archive-mode "  " steven-icons-directory)
    (diff-mode " ⇄ " steven-icons-yellow)
    (prog-mode " ⨍ " steven-icons-magenta)
    (org-mode "  " steven-icons-gray)
    (help-mode "   " steven-icons-gray)
    (info-mode "   " steven-icons-gray)
    (conf-mode "  " steven-icons-gray)
    (text-mode "  " steven-icons-green)
    (comint-mode "  " steven-icons-gray)
    (pdf-view-mode " PDF " steven-icons-gray)
    (eww-mode "  " steven-icons-gray)
    (read-only "" steven-icons-red)
    (dedicated "" steven-icons-red)
    (document "󰷈" steven-icons-red)
    (audio "𝅘𝅥𝅮" steven-icons-cyan)
    (image "𜷻" steven-icons-yellow)
    (video "▶" steven-icons-blue)
    (frame "" steven-icons-gray)
    (git "⇅" steven-icons-gray)
    (t " " steven-icons-gray))
  "Same as `steven-icons-alphabetic' with Unicode symbols.")

(defun steven-icons--get (thing)
  "Return `steven-icons' representation of THING."
  (unless (symbolp thing)
    (error "The thing `%s' is not a symbol" thing))
  (let ((icons steven-icons-symbolic)
        icon)
    (while (and thing (not icon))
      (setq icon (alist-get thing icons))
      (unless icon
        (setq thing (get thing 'derived-mode-parent))))
    (or icon (alist-get t icons))))

;;;###autoload
(defun steven-icons-get-icon (thing &optional face)
  "Return propertized icon THING."
  (pcase-let ((`(,icon ,inherent-face) (steven-icons--get thing)))
    (let ((face (or face inherent-face)))
      (concat
 (propertize icon 'face face)
 (propertize " " 'display '(space :width 0.5) 'face face)))))

(provide 'steven-icons)
;;; steven-icons.el ends here  
#+end_src

** The =steven-modeline.el= section

This is my setup of a custome ’modeline’, which is actually an
headerline. Is is inspired by the nano modeline of N. Rougier and the
work of Prot. Some notes:

- When boxing the header line, we need to use another face (i.e. not
  header-line) with the :box attribute, otherwise box rendering behaves
  unexpectedly.
- I only initialize the faces here, they are defined in my section on
  setting the modeline: [[*The =init.el= section to setup the modeline]]

#+begin_src emacs-lisp :tangle "steven/steven-headerline.el"
;;; -*- lexical-binding: t -*-
(defgroup steven-headerline nil
  "Custom modeline that is stylistically close to the default."
  :group 'header-line)

(defgroup steven-headerline-faces nil
  "Faces for my custom modeline."
  :group 'steven-headerline)

(defface steven-header-line
  '((t (:inherit header-line)))
  "Face for active header line"
  :group 'steven-headerline-faces)

(defface steven-header-line-inactive
  '((t (:inherit header-line-inactve)))
  "Face for inactive header line"
  :group 'steven-headerline-faces)

(defface header-line-status
  '((t (:inherit header-line)))
  "Face for active header line status icon"
  :group 'steven-headerline-faces)

(defface header-line-status-inactive
  '((t (:inherit header-line-inactve)))
  "Face for inactive header line status icon"
  :group 'steven-headerline-faces)

(defun steven-modeline-major-mode-icon ()
  "Return icon for the major mode."
  (if (mode-line-window-selected-p)
    (steven-icons-get-icon major-mode 'header-line-status)
  (steven-icons-get-icon major-mode 'header-line-status-inactive)))

(defvar steven-headerline-dont-show-modes
  '(dired-mode)
  "List of major modes for which the headerline does not show the mode.")

(defun steven-headerline-major-mode-name ()
  "Return the capitalized major mode name unless it's in `steven-headerline-dont-show-modes`."
  (if (or (not (mode-line-window-selected-p))
          (memq major-mode steven-headerline-dont-show-modes))
      ""
    (capitalize
     (string-remove-suffix
      "-mode"
      (symbol-name major-mode)))))

(defun steven-headerline-buffer-name-face ()
  (let* ((active (mode-line-window-selected-p))
         (modified (and (buffer-file-name)
                        (buffer-modified-p)))
         (base-face (if active
                        'header-line
                      'header-line-inactive)))
    `(:inherit ,base-face
      :weight bold
      ,@(when modified
          '(:slant italic)))))

(defun steven-headerline-buffer-name ()
  (propertize
   (buffer-name)
   'face (steven-headerline-buffer-name-face)))

(defun steven--headerline-get-silo ()
  "Return the conext for the current buffer defined by steven--context-var,
or nil."
  (when (and (boundp 'steven--context-var)
             (local-variable-p 'steven--context-var)
             steven--context-var)
    (let ((silo-name steven--context-var))

       (format "%s%s" " " silo-name))))
        ;'face  'header-line))))

(defun steven--headerline-git-project-name (&optional symbol)
  "Return the current Git project name."
  (when-let* ((file (buffer-file-name))
              (git-root (vc-call-backend 'Git 'root file))
              (project-name
               (file-name-nondirectory
                (directory-file-name git-root))))
    (propertize
     (format "%s%s" (or symbol " ") project-name))))

(defun steven--headerline-git-info (&optional symbol)
  "Git information as (branch, file status)"

  (when vc-mode
      (when-let* ((file (buffer-file-name))
                  (branch (substring-no-properties vc-mode 5))
                  (state (vc-state file)))

        (propertize (format "%s%s, %s" (or symbol " ") branch state)))))
       ; 'face  'header-line))))

(defun steven-headerline-context ()
  "Return Denote silo OR Git project for the modeline"
  (when (mode-line-window-selected-p)
    (when-let* ((name (or (steven--headerline-get-silo)
                         (steven--headerline-git-project-name))))
      (format "(%s)" name))))

(defun steven-header-line-window-dedicated ()
  "Return a pin symbol if window is dedicated, otherwise empty string."
  (propertize
   (if (window-dedicated-p) " " "")
   'face 'header-line))

(defun steven-header-line-pdf-page ()
  "PDF view mode page number / page total."
  (when (derived-mode-p 'pdf-view-mode)
    (let ((page-current (pdf-view-current-page))
          (page-total (pdf-cache-number-of-pages)))
      (propertize
       (format "%d/%d " page-current page-total)
       ;'face 'steven-header-line
       ))))

(defun steven--header-line-language ()
  "Return `steven--current-language' as \"EN \" or \"NL \"."
  (propertize
   (alist-get steven--current-language
              '(("english" . "EN ")
                ("dutch" . "NL "))
              nil nil #'string=)
   'face '(:weight bold)))

(defun steven-header-line-ispell-dict ()
  "Return an icon if Flyspell is active."
  (when (and (bound-and-true-p flyspell-mode)
             (bound-and-true-p ispell-current-dictionary))
    (propertize ""
     'face '(:weight bold)
     )))

(defun steven--modeline-file-size ()
  "File size in human readable format"

  (if-let* ((file-name (buffer-file-name))
            (file-attributes (file-attributes file-name))
            (file-size (file-attribute-size file-attributes))
            (file-size (file-size-human-readable file-size)))
      (propertize (format "%s " file-size)
                  ;'face (nano-modeline-face 'primary)
                  )
    ""))

;;;; Cursor position

(defun steven--modeline-cursor-position (&optional format)
  "Cursor position using given FORMAT."

  (let ((format (or format "%l:%c ")))
    (propertize (format-mode-line format)
                ;'face (nano-modeline-face 'primary)
                )))

;;;; Line count

(defun steven--modeline-buffer-line-count ()
  "Buffer total number of lines"

  (save-excursion
    (goto-char (point-max))
    (propertize
     (format-mode-line "(%l lines)")
     ;'face (nano-modeline-face 'primary)
     )))

(defun steven--modeline-kbd-macro ()
    "Specific to the current window's mode line."
      (when (and (mode-line-window-selected-p) defining-kbd-macro)
        (propertize " KMacro " 'face 'steven-modeline-indicator-bg)))

;;;; Narrow indicator

(defun steven--modeline-narrow ()
    "Mode line construct to report the narrowed state of the current buffer."
      (when (and (mode-line-window-selected-p)
                 (buffer-narrowed-p)
                 (not (derived-mode-p 'Info-mode 'help-mode 'special-mode 'message-mode)))
        (propertize " Narrow " 'face 'steven-modeline-indicator-bg)))

;;;; Input method

(defun steven--modeline-input-method ()
    "Mode line construct to report the multilingual environment."
      (when current-input-method-title
        (propertize (format " %s " current-input-method-title)
                    'face '(:weight bold)
                    'mouse-face 'mode-line-highlight)))

;;;; Buffer status

;; TODO 2023-07-05: What else is there beside remote files?  If
;; nothing, this must be renamed accordingly.
(defun steven-modeline-buffer-status ()
    "Mode line construct for showing remote file name."
      (when (file-remote-p default-directory)
        (propertize " @ "
                    'face 'steven-modeline-indicator-bg
                    'mouse-face 'mode-line-highlight)))

;;;; Terminal

(defun nano-modeline-terminal-directory (&optional max-length)
  "TERMINAL: Current working directory"

  (let* ((max-length (or max-length 32))
         (dir default-directory)
         (path (reverse (split-string (abbreviate-file-name dir) "/")))
         (output ""))
    (when (and path (equal "" (car path)))
      (setq path (cdr path)))
    (while (and path (< (length output) (- max-length 0)))
      (setq output (concat (car path) "/" output))
      (setq path (cdr path)))
    (when path
      (setq output (concat "…/" output)))
    (format "%s " output)))

(defun nano-modeline-terminal-mode ()
  "TERMINAL: mode"
  (if-let* ((mode (cond ((derived-mode-p '(term-mode))
                        (cond ((term-in-char-mode) "char")
                              ((term-in-line-mode) "line")
                              (t                   "????")))
                       ((derived-mode-p '(eat-mode))
                        (cond (eat--semi-char-mode "semi-char")
                              (eat--char-mode "char")
                              (eat--line-mode "line")
                              (t               "????")))
                       (t "????"))))
      (format "(%s mode)" mode)
    ""))

(defun nano-modeline-terminal-shell ()
  "TERMINAL: shell name"
  (format "%s" shell-file-name))

;;;### autoload
(defun nano-modeline-terminal (&optional where)
  "TERM: term mode (including eat)"

  (interactive)
  (nano-modeline where nil
                 (lambda () (nano-modeline-buffer-status ">_"))
                 #'nano-modeline-terminal-shell
                 #'nano-modeline-terminal-mode
                 #'nano-modeline-terminal-directory))

;;;; Alignment functions


(defun steven-header-line-right ()
  "Text to be right aligned"
  (concat
   ;(or (steven-header-line-ispell-dict) "")
   (or (steven-header-line-pdf-page) "")
   (or (steven-header-line-window-dedicated))))

;still used currently.
(defun steven-header-line-align-right ()
  "Return a right aligned string taking into account relevant text"
 (let* ((right-str (steven-header-line-right))
        (right-width (string-width right-str)))
   (propertize
    " "
    'display
    `(space :align-to (- right ,right-width)))))

(defun steven-header-line-propertize (text)
  "Information using primary face"
  (propertize text 'face 'header-line))

(provide 'steven-headerline)
;;; steven-headerline.el ends here
#+end_src

This is from nano emacs, not sure if I want to keep it:
#+begin_src emacs-lisp
(defun nano-modeline-update-windows ()
  "Modify the mode line depending on the presence of a window
below or a buffer local variable 'no-mode-line'."
  (dolist (window (window-list))
    (with-selected-window window
	  (with-current-buffer (window-buffer window)
        (if (or (not (boundp 'no-mode-line)) (not no-mode-line))
            (set-window-parameter window 'mode-line-format
                                  (cond ((not mode-line-format) 'none)
                                        ((one-window-p t 'visible) (list ""))
                                        ((eq (window-in-direction 'below) (minibuffer-window)) (list ""))
                                        ((not (window-in-direction 'below)) (list ""))
                                        (t 'none))))))))

(add-hook 'window-configuration-change-hook 'nano-modeline-update-windows)
#+end_src

* Local variables

;; Local Variables:
;; End:

